Revit 2027 API
View3D.SetOrientation Method
 Sets the temporary orientation of the View3D. The new orientation is not saved in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOrientation(
	ViewOrientation3D newViewOrientation3D
)
Public Sub SetOrientation (
	newViewOrientation3D As ViewOrientation3D
)
public:
void SetOrientation(
	ViewOrientation3D^ newViewOrientation3D
)
member SetOrientation :
        newViewOrientation3D : ViewOrientation3D -> unit
Parameters
newViewOrientation3D ViewOrientation3D
 The new orientation to set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  View is locked and cannot be reoriented.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace